#Область ПрограммныйИнтерфейс

// Вызываемая процедура для создания реквизита "КонтактноеЛицо" на формах документов.
Процедура Дополнитьформу(форма) Экспорт

	Имяформы = Форма.Имяформы; 

	Если Имяформы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда

		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);         

	ИначеЕсли Имяформы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда  

		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);                            

	ИначеЕсли Имяформы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда   

		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);                            

	ИначеЕсли Имяформы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда  

		ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(форма); 

	ИначеЕсли Имяформы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда 

		ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(форма); 

	КонецЕсли;           

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Создает реквизит в шапке документа под реквизитом "Договор".
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма) 

	ПолеВвода = форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода;
	ПолеВвода. ПутьКДанным = "Объект.ТП_КонтактноеЛицо"; 

КонецПроцедуры          

// Создает реквизит на форме документа перед реквизитом "Суммадокумента".
Процедура ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(форма) 

	ПолеВвода = форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ТП_КонтактноеЛицо"; 

КонецПроцедуры

#КонецОбласти