
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ДополнениеФормыДокумента(ЭтотОбъект);
	
	Реквизит = Новый Массив;
	Реквизит.Добавить(Тип("СправочникСсылка.ТП_КонтактныеЛица"));
	
	ТипДляРеквизита = Новый ОписаниеТипов(Реквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("КонтактноеЛицо", ТипДляРеквизита,, "Контактное Лицо", Истина);
	
	ДобавлениеРевизитов = Новый Массив;
	ДобавлениеРевизитов.Добавить(НовыйРеквизит);
	
	ИзменитьРеквизиты(ДобавлениеРевизитов);
	
	КонтактноеЛицо = Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво);
	КонтактноеЛицо.ПутьКданным = "КонтактноеЛицо";
    КонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	
	//Связь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	//Массив = Новый Массив;
	//Массив.Добавить(Связь);
	//СвязьМассива = Новый ФиксированныйМассив(Массив);
	//Элементы.КонтакноеЛицо.СвязиПараметровВыбора = СвязьМассива;
	
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	//РассчитатьСуммуДокумента();
	
	//Доработка и Изменения
	Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	Скидка = (Сумма * Объект.СогласованнаяСкидка)/100;
	ТекущиеДанные.Сумма = Сумма - Скидка; 
	 
    РассчитатьСуммуДокумента();
   
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры



#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#Область Доработки

&НаКлиенте
Процедура Скидка(Команда)
	ИРТСкидкаПередНаКлиенте();
КонецПроцедуры

&НаКлиенте
Асинх Процедура СогласованнаяСкидкаПриИзменении(Элемент)
	
	Если Объект.Услуги.Количество() > 0 И Объект.Товары.Количество() > 0 Тогда
	Ответ = Ждать ВопросАсинх("Пересчитать скидку?", РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
	Сообщить("Список пуст!");
	КонецЕсли;	
	
	Если Ответ = КодВозвратаДиалога.Да Тогда	
		ИРТСкидкаПередНаКлиенте();	
	КонецЕсли;			

КонецПроцедуры

&НаКлиенте
Процедура ИРТСкидкаПередНаКлиенте()
	
	Для Каждого Услуги Из Объект.Услуги Цикл
    	РассчитатьСуммуСтроки(Услуги);
	КонецЦикла;
	Для Каждого Товары Из Объект.Товары Цикл
    	РассчитатьСуммуСтроки(Товары);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти
